[
  {
    "jurisdiction": "sanbernardino",
    "code": "01297",
    "title": "Assistant Chief Probation Officer",
    "description": "Definition\nUnder general direction, assists the Chief Probation Officer with the planning, organization, administration, and direction of the activities of the Probation Department; acts for the Chief Probation Officer during absences and when assigned; performs related duties as required.\nDistinguishing Characteristics\nThis is a single position class characterized by responsibility to assist the Chief Probation Officer with the administrative functions of all probation services and activities. The position reports directly to the Chief Probation Officer and serves at the pleasure of the appointing authority.\nExamples of Duties\nDuties may include, but are not limited to, the following:\n1.    Assist the Chief Probation Officer in the formulation of policies and procedures for the administration of the County Probation Department.\n2.    Ensures departmental compliance with all applicable laws and regulations.  Aid the Chief Probation Officer in coordinating department operations with the courts, law enforcement agencies, and related organizations.\n3.    Assist in the direction of the preparation and administration of the department’s budget; cooperate with the Chief Probation Officer to assure that fiscal controls are established and that program objectives are met in a cost-effective manner.\n4.    Assess service and new program needs and make recommendations to the Chief Probation Officer; in the absence of or when directed by the Chief Probation Officer, make recommendations to the Board of Supervisors, County Administrative Office, and the courts.\n5.    Manage a large, multi-disciplined staff through subordinate administrators. Evaluate department personnel actions and the performance of subordinates.\n6.    Review proposed legislation, and operational, policy and program changes within the courts and law enforcement to determine impact on the Probation Department.\n7.    Assist the Chief Probation Officer in working with the media to develop and maintain a comprehensive public information program.\n8.    Represent the County and maintain liaison with community organizations for the purpose of informing the public and promoting good will toward the department.  Make presentations to groups such as the Board of Supervisors, the Juvenile Justice Commission, and the Civil Service Commission to explain the department’s positions, standards, and policies.\n9.    Attend meetings to maintain communication with the court and to resolve complaints and problems.\n10.    Respond to disturbances in Probation institutions including riots, fires, staff problems, suicides, and accidental deaths.\n11.    Direct the preparation of reports, correspondence and other documents as required.\n12.    Assumes Chief’s duties in Chief’s absence.\n13. Responds promptly to time-sensitive incidents by driving either a personal or county vehicle to remote or distant locations as required, ensuring timely resolution and support based on the nature and urgency of the situation.\n14.    Provides vacation and temporary relief as required.\nRepresentation Unit\nExempt\nSalary Range\n85C\nSupplemental Information\nThis position has peace officer status under Penal Code Section 830.5 and may require incumbents to be armed.  All Probation Officers will be expected to participate in a continuum of force training program which include control of aggression, tactical negotiations, unarmed defensive tactics and use of pepper spray.  Incumbents must also enroll in, and successfully complete, the department’s arming training, maintain qualification standards, and must be willing to accept an armed assignment at the discretion of the appointing authority."
  },
  {
    "jurisdiction": "ventura",
    "code": "09111",
    "title": "Apcd Public Information Specialist",
    "description": "Definition\nUnder direction of the Public Information Manager, provides information and advice concerning air pollution to the public.\nDistinguishing Characteristics:\nThis classification is responsible for assisting the Public Information Manager in informing citizens about air pollution in Ventura County.\nExamples Of Duties\nDuties may include, but are not limited to, the following:\nResponds to public and media inquiries regarding District activities and refers media to the appropriate division.\nWrites brochures, pamphlets, news releases, speeches, scripts for radio and television public service announcements, and advertising for other outreach events.\nParticipates in workshops, panel discussions, and fairs tailoring material and choice of language to audience.\nRepresents Air Pollution Control District at meetings and conferences of interested groups, educates the public about air quality management activities, and answers complaints and questions.\nGives presentations at schools with use of audio-visual equipment and materials in order to inform students of the District's role, in particular, and of air pollution causes, effects, and solutions in general.\nContributing writer for District publications including \"Skylines\".\nAssists in District advertising program.\nAssists with special projects as requested by the APC Board.\nAssists in obtaining funding for public information projects.\nQualification Guidelines\nKnowledge, Skills, and Abilities:\nSome knowledge of: basic research techniques, methods, and procedures; federal, state, and local government organization; curriculum development.\nWorking knowledge of: layout, printing display, and photography.\nThorough knowledge of: written and oral communication.\nWorking ability to: understand, interpret, and present orally and in writing, technical data reports; prepare, organize and present speeches, articles, scripts, and related information; quickly make decisions regarding appropriate responses to press inquiries without opportunity for referral to supervisor; establish and maintain effective working relationships with coworkers, citizens, interest groups, and public agencies.\nRecruiting Standards\nEducation/Experience:\nAny combination of experience/education leading to the required knowledge and abilities. The required knowledge and abilities also can be obtained by completion of a bachelor's degree in journalism, communications, public relations, or a related field and at least two (2) years of experience in the public information/communication field. One year of experience in air pollution control or closely related field is desirable.\nPhysical Demands:\nWork is performed primarily in an indoor environment with heavy public contact and involves moderate activities including occasional lifting up to 40 pounds, climbing ladders, walking, bending, stooping, reaching, squatting, pushing and pulling display cases and other audio-visual material.\nOther Requirements\nSpecial Requirements:\nMust possess and maintain a valid California driver license."
  },
  {
    "jurisdiction": "sanbernardino",
    "code": "10019",
    "title": "Assistant Director of Human Resources",
    "description": "Definition\nUnder general direction, assists in the administration of all County human resources programs; advises the Director of Human Resources and oversees the daily operations of the department; performs related duties as required.\nDistinguishing Characteristics\nThis classification is characterized by its responsibility to provide assistance to the Director of Human Resources; coordinate the activities of the department’s divisions; perform work with considerable independence and in accordance with personnel management policy guidelines established by Director. The position reports to Director of Human Resources.\nExamples of Duties\n1.Directs through subordinate managers, the daily department operations and delivery of human resources services to departments and employees.\n2.Performs initial review of requests requiring the Director’s approval; approves requests as designee; meets with departmental managers to determine best practice approach to issues.\n3.Evaluates departmental effectiveness and recommends changes as required.\n4.Recommends and coordinates the implementation of personnel management policies and procedures within the framework of the County’s personnel system and legal mandates.\n5.Interprets, explains, and ensures compliance with County Personnel Rules, labor contracts, ordinances and other personnel policies.\n6.Coordinates the preparation, justification and administration of the department budget.\n7.Makes presentations to department administrators and employee associations.\n8.Manages a staff of support personnel through subordinate managers.\n9.Represents the Director in his/her absence.\n10.Provides vacation and temporary relief as required.\nRepresentation Unit\nExempt\nSalary Range\n87C\nSupplemental Information\nThis position is in the Unclassified Service and serves at the pleasure of the appointing authority."
  },
  {
    "jurisdiction": "sanbernardino",
    "code": "01410",
    "title": "Assistant District Attorney",
    "description": "Definition\nUnder general administrative direction, assist the District Attorney in the administration of the District Attorney's Office; supervise and direct all functions through subordinates; act for the District Attorney during absences; perform related duties as required.\nDistinguishing Characteristics\nThis is a single position class characterized by the responsibility to participate with the District Attorney in making departmental policy; and by the responsibility to direct the implementation of policy through subordinate management and supervisory levels. The position reports to the elected District Attorney.\nExamples of Duties\nDuties may include, but are not limited to, the following:\n1. Direct operations and supervise a large staff; assist with policy interpretation reviews decisions on all complex or political legal issues. Make interim policy and procedural decisions in the absence of the District Attorney.\n2. Provide advice and/or approves disposition on the handling of non routine criminal matters as in public interests cases.\n3. Determine whether conflict of interest exists in cases to be prosecuted by the District Attorney and refer these cases to the Attorney General's Office.\n4. Review and determine appropriateness of extraditions giving consideration to case facts and cost entailed; forwards extraditions to the District Attorney for signature before sending to the Governor for final approval.\n5. Represent the District Attorney before the public by making presentations to civic groups, Sheriff's classes, conventions and legislative committees for the purpose of promoting goodwill toward the department and gaining support on controversial matters. May testify for the District Attorney at state legislative hearings to justify departmental position on pending issues.\n6. Write comprehensive reports and letters for broad audiences to seek support, to supply information and explain intentions of District Attorney's Office. May draft legislation for local legislators to carry to state offices.\n7. Maintain liaison between staff, judges, law enforcement and defense attorneys regarding policy matters of District Attorney and resolve problems resulting from conflicting opinions.\n8. Recommend appointments of attorneys; approve or deny step increases; initiate or approve promotions and disciplinary actions; recommend staff reassignments and terminations to the District Attorney who gives final approval.\n9. Direct the preparation of the annual budget and review proposed changes with the District Attorney.\n10. Review the objectives and effectiveness of all organizational segments of the District Attorney's Office and suggest or direct changes to improve efficiency.\n11. Responds promptly to time-sensitive incidents by driving either a personal or county vehicle to remote or distant locations as required, ensuring timely resolution and support based on the nature and urgency of the situation.\n12. Provide vacation and temporary relief as required.\nRepresentation Unit\nExempt\nSalary Range\n97B\nSupplemental Information\nPosition is in the Unclassified Service. The incumbent must be a member of the State Bar of California."
  },
  {
    "jurisdiction": "ventura",
    "code": "02181",
    "title": "Assistant Chief Probation Officer",
    "description": "Definition\nDEFINITION:\nUnder general direction, assists the Chief Probation Officer with the planning, organization, administration, and direction of the activities of the Probation Agency; acts for the Chief Probation Officer during absences and when assigned; performs related duties as required.\nDISTINGUISHING CHARACTERISTICS:\nThis is a single position class characterized by responsibility to assist the Chief Probation Officer with the administrative and/or operational functions of all probation services and activities. The position reports directly to the Chief Probation Officer and serves at the pleasure of the appointing authority.\nExamples Of Duties\nDuties may include, but are not limited to, the following:\nAssists the Chief Probation Officer in the formulation of policies and procedures for the administration of the County Probation Agency.\nEnsures compliance with all applicable laws and regulations; aids the Chief Probation Officer in coordinating Agency operations with the courts, law enforcement agencies, and related organizations.\nAssists in the direction of the preparation and administration of the Agency’s budget; collaborates with the Chief Probation Officer to ensure that fiscal controls are established and that program objectives are met in a cost-effective manner.\nAssesses services and new program needs and makes recommendations to the Chief Probation Officer; in the absence of or when directed by the Chief Probation Officer, makes recommendations to the Board of Supervisors, County Executive Office, and the courts.\nManages a multi-disciplined management team; evaluates agency personnel actions and the performance of subordinates.\nReviews proposed legislation, operational, policy and program changes to determine impact on the Probation Agency.\nWorks with the Agency’s communication manager and media to develop and maintain a comprehensive public information program.\nWorks with Chief Deputies and Division Managers on the implementation and ongoing efforts related to the Agency’s Strategic Plan.\nRepresents the County and maintains liaison with community organizations for the purpose of informing the public and promoting good will toward the Agency; makes presentations to groups to explain the Agency’s positions, standards, and policies.\nAttends meetings to maintain communication with the court, justice partners and other stakeholders.\nResponds to situations at the Agency’s Juvenile Facilities, Field Operations, and related facilities.\nAssumes the Chief Probation Officer’s duties in the Chief’s absence.\nPerforms other duties as assigned.\nQualification Guidelines\nMINIMUM QUALIFICATIONS:\nPossession of a bachelor's degree from an accredited college or university preferably in behavioral science, social science, psychology, sociology, criminology, or a related field And,\nExperience:\nExtensive and progressively responsible administrative and/or management experience; two (2) years must have been in a capacity equivalent to (or higher than) a Probation Division Manager in probation, parole services and institutional corrections functions with major budgetary responsibilities.\nAdditional related experience may substitute for the education on a year-for-year basis. A graduate degree in a related field is desirable.\nRecruiting Standards\nKNOWLEDGE AND SKILLS:\nKnowledge of:\nPrinciples and practices of the role and function, responsibility, and authority of a County Probation Agency\nFederal and state regulations impacting the delivery of Probation services, the Welfare and Institution Code, the Penal Code, health and Safety Code, Government code, State Legislation, Peace Officer Bill of Rights, and other laws and regulations relating to probation operations.\nPhilosophy, principles, and practices of social casework pertaining to the investigation, evaluation, and detention of juveniles and young adults, including placement services and treatment.\nInvestigation and evaluation of adult offenders sentenced to supervision by Probation.\nTheory, principles and practices of public sector financial administration, governmental budgeting, grants, funding proposal development, reimbursement claiming, procedures and contracts administration.\nPrinciples of modern organizational development, public sector management and supervision, human resources development and public relations.\nCommunity resources and current alternative sentencing and treatment trends in the field of professional Probation, Parole and Corrections services.\nFederal and state grants, funding proposal development, reimbursement claiming procedures and contracts administration.\nAbility to:\nExercise supervision and accountability over a team of managers and executives\nDemonstrate commitment to the County’s mission, vision, and goals.\nContinually model excellence and demonstrate vision, leadership, strong managerial skills, and innovation.\nAdminister, plan, organize and direct the administrative and financial operations of the Probation Agency\nCoordinate varied and complex probation activities, in order to gain the cooperation of the professional and administrative personnel involved.\nCommunicate effectively orally, and demonstrate strong writing skills by preparing clear, concise, and timely reports and correspondence.\nEstablish and maintain effective collaborative working relationships with the Board of Supervisors, other elected and appointed officials, County Administrator's staff, community organizations, other County Agencies management staff and others.\nAnalyze and evaluate Agency-wide programs and administrative problems, identify alternative solutions, and recommend practical, logical, and effective solutions.\nAnalyze new or proposed Federal and State legislation and to assess and report on the impact to the Agency's operations.\nPlan, organize and direct the multidisciplinary work of Agency staff, including professional and administrative (sworn and/or non-sworn) support personnel.\nOther Requirements\nSUPPLEMENTAL INFORMATION:\nThis position has peace officer status under Penal Code Section 830.5 and may require incumbents to be armed.  All Probation Officers will be expected to participate in a continuum of force training program which include control of aggression, tactical negotiations, unarmed defensive tactics and use of oleoresin capsicum spray.  Incumbents must also enroll in, and successfully complete, the department’s arming training, maintain qualification standards, and must be willing to accept an armed assignment at the discretion of the appointing authority.\nAt the time of appointment (or by 6 months after appointment), candidate must possess Penal Code 830.5 status.\nCandidate may be required to pass a thorough background investigation that will include, but not necessarily be limited to, contacting personal, educational and business references, and Livescan fingerprinting for a criminal records check. Additionally, certified candidates will undergo a polygraph, psychological, and medical examination. Those entering the background process are required to provide a current (issued within the past 30 days) Department of Motor Vehicles printout (K4 - 10-year driving record) to the Background Investigator."
  },
  {
    "jurisdiction": "ventura",
    "code": "00080",
    "title": "Appraiser Trainee",
    "description": "Definition\nUnder general supervision (Trainee, I) general supervision (I, II), or direction (III), performs progressively complex assignments in the appraisal of real property for ad valorem taxes; and performs related duties as required.\nDistinguishing Characteristics:\nAt each successive level, incumbents are expected to demonstrate greater initiative, self-direction, independent judgment and conflict resolution with less supervision than preceding levels.\nAppraiser Trainee\nis the entry-level class. Incumbents receive training and assist higher-level appraisers in performing routine field and office duties involved in the appraisal of real property.\nAppraiser I\nis the intermediate level class. Incumbents appraise residential subdivisions, tracts and areas with an active market and a fair degree of comparability among properties.\nAppraiser II\nis the journey-level class. Incumbents independently performs appraisal work on a wide range of residential as well as non-residential real properties (i.e., commercial, industrial and rural) applying all three (3) approaches to valuation (cost, comparative sales and income).\nAppraiser III\nis the advanced-journey level class. Incumbents spend the majority of their time performing the most difficult and complex appraisals of large commercial, industrial, petroleum, agricultural, possessory interests and unique special-use properties, presenting the most complex assessment appeal cases, and providing training, quality assurance and guidance to lower level appraisers in proper appraisal practices and procedures.\nPromotion to the Appraiser I and II levels will be non-competitive subject to successful completion of the requirements specified in the Ventura County Assessor's Office \"Career Ladder\" Program.\nExamples Of Duties\nDepth and breadth of assignments increase at each level. Duties may include, but are not limited to the following:\nAppraiser Trainee/I\n:\nExamines new and existing single-family homes, new residential tracts for types and quality of construction.\nClassifies structures according to shape, size, types of construction and estimated costs, reads and interprets blueprints.\nObtains, verifies, and analyzes pertinent sales information, income and cost data to arrive at value conclusions.\nContacts realtors, builders, lending agencies, city planning offices and property owners to gather information pertaining to factors which affect market values.\nIdentifies and recognizes view factors and negative influences such as railroads, freeways, drainage channels, or adjacent commercial uses.\nDetermines depreciation factors and their effects on market value.\nQualification Guidelines\nKnowledge, Skills, and Abilities:\nSome to thorough knowledge (depending on level in series) of: state and local laws relating to property valuations; appraisal methods and techniques; the effect of economic trends on building construction, practices, materials and the other factors involved in the valuation of land, financial records and accounting practices relating to depreciation and income capitalization, current social, political, economic, and scientific developments and trends; policies and procedures of the Assessor's Office.\nSome to thorough ability (depending on level in series) to: make appraisals; assemble and analyze appraisal data; analyze factors influencing the changing valuation of real property; make arithmetical calculations, charts, and sketches in connection with appraisal work; establish and maintain cooperative working relationships with persons contacted in the course of work; analyze situations accurately and adopt an effective course of action; prepare written correspondence and reports; print and write legibly and communicate effectively; read maps and make aerial map analyses; work independently or with minimum supervision. Operate a personal computer in an on-line processing environment; and utilize Microsoft office software application programs. At the Appraiser III level, must: possess ability to direct, train and review appraisal work of lower level employees.\nSupplemental Information:\nAppraisers are required to conduct field appraisal work and may be exposed to hazardous conditions, inclement weather and uncooperative and/or hostile property owners. Incumbents are required to sit, stand, walk, bend, stoop, squat, twist, reach and occasionally work on irregular surfaces.\nRecruiting Standards\nEducation/Experience:\nProgressively responsible experience in real property appraisal which has led to the acquisition of the required knowledge and abilities. The required knowledge and abilities also can be obtained by completion of a Bachelor's degree from an accredited institution AND:\nAppraiser Trainee: No experience required.\nOther Requirements\nSpecial Requirements:\nA valid California driver's license is required at the time of appointment and must be maintained throughout employment.\nCertification: Appointees must attain State certification as an Appraiser for property tax purposes within one (1) year of appointment. Failure to pass the State Board of Equalization Certification Examination within one year may result in termination.\nConflict of Interest Statement:\nIn accordance with the Political Reform Act of 1974, incumbents at all levels will be required to file an annual Conflict of Interest Statement."
  },
  {
    "jurisdiction": "sdcounty",
    "code": "03697",
    "title": "Associate Meteorologist",
    "description": ".\nCLASSIFICATION PURPOSE AND DISTINGUISHING CHARACTERISTICS\nTo analyze and predict meteorologist conditions as applied to air pollution formation, transport, and dispersion; and to perform related work as required.\nThis is the journey-level class in the Meteorologist series. Under general supervision, incumbents are responsible for independently performing a wide range of air quality control forecasting and modeling analyses.\nThe complete Meteorologist series includes the following:\nAssistant Meteorologist (Class No. 003696)\nAssociate Meteorologist (Class No. 003697)\nSenior Meteorologist (Class No. 003698)\nEXAMPLES OF DUTIES\nThe examples of functions listed in this class specification are representative but not necessarily exhaustive or descriptive of any one position in the class. Management is not precluded from assigning other related functions not listed herein if such functions are a logical assignment for the position\n.\nReasonable accommodations may be made to enable qualified individuals with disabilities\nto perform the essential functions of a job, on a case-by-case basis.\nEssential Functions:\nApplies air pollution models and interprets modeling results for strategy development, regulatory permit, and health risk assessment.\nPerforms sensitivity analysis.\nOversees the selection of site and meteorological equipment.\nProvides emergency response support and evacuation guidance upon request.\nMay be required to perform the functions of the lower level class in this series.\nKNOWLEDGE, SKILLS AND ABILITIES\nKnowledge of:\nApplicable state and federal laws pertaining to air pollution control, including the Federal Clean Air Act and California Clean Air Act\nAtmospheric and air pollution processes\nRegulatory modeling guidelines and applications\nComputer modeling applications\nAir pollution modeling technology\nCustomer service objectives and strategies\nTelephone, office, and online etiquette\nCurrent technology and trends in the profession\nSkills and Abilities to:\nApply modeling results for strategy development, regulatory permit, and health risk assessment\nResearch, evaluate, and recommend new air pollution models for acquisition and use\nForecast air quality\nCollect, analyze, monitor, and evaluate air quality and meteorological data\nReview meteorological and air quality data to determine source impacts on regional air quality\nEnsure clean air goals are being met\nEnter and retrieve date from computer\nEstablish and maintain effective working relationships with representatives from outside agencies, news media, and the public\nCommunicate effectively, both orally and in writing, with a variety of individuals representing diverse cultures and backgrounds and function calmly in challenging situations, which require a high degree of sensitivity, tact and diplomacy\nTreat employees, representatives of outside agencies and members of the public with courtesy and respect\nDesirable Traits\nCommunicates Effectively, Customer Focused, Values and Respects Others, Drives to Excel, Teamwork and Collaboration, Continuous Learning, Demonstrates Ethical Behavior, Supportive of Change\n.\nEducation and/or Experience\nEducation, training, and/or experience that demonstrate possession of the knowledge, skills and abilities listed above. Qualifying education/experience:\nA bachelor's degree from an accredited U.S. college or university, or a certified foreign studies equivalency, in meteorology, atmospheric science or a closely related field; AND, three (3) years of experience performing meteorological/air quality analysis and/or forecasting. One (1) year of the required experience must have included air pollution meteorology and/or modeling application, OR,\nThree (3) years of experience as an Assistant Meteorologist with the  San Diego County Air Pollution Control District.\nNote:\nA master's degree from an accredited U.S. college or university, or a certified foreign studies equivalency, in meteorology or a closely related field may substitute for up to two (2) years of the required experience.\n.\nREQUIRED LICENSES, CERTIFICATIONS OR REGISTRATIONS\nRequired licenses, certifications and registrations must be maintained throughout employment in this class.\nPositions may involve necessary and timely transportation for field travel, requiring the ability to arrange transportation to different worksites, meetings, or field work.\nCertification/Registration\nNone Required.\nSPECIAL NOTES\nWorking Conditions\nWeekend and irregular work schedules may be required.\nEssential Physical Characteristics\nThe physical characteristics described here are representative of those that must be met by an employee to successfully perform the essential functions of this classification. Reasonable accommodations may be made to enable qualified individuals with disabilities\nto perform the essential functions of a job, on a case-by-case basis.\nContinuous: upward and downward flexion of the neck. Frequent: sitting, repetitive use of hands to operate meteorological equipment. Occasional: walking, standing, bending and twisting of neck, bending and twisting of waist, squatting, simple grasping, reaching above and below shoulder level, and lifting and carrying materials weighing up to 50 pounds.\nBackground Investigation\nMust have a reputation for honesty and trustworthiness. Misdemeanor and/or felony convictions may be disqualifying depending on type, number, severity, and recency. Prior to appointment, candidates will be subject to a background investigation.\nPROBATIONARY PERIOD AND CLASS HISTORY\nIncumbents appointed to permanent positions in this classification shall serve a probationary period of 12 months.\nAssociate Meteorologist (Class No. 003697)             Union Code: PR             Variable Entry: Y"
  },
  {
    "jurisdiction": "sdcounty",
    "code": "0265",
    "title": "Assistant Sheriff",
    "description": ".\nCLASSIFICATION PURPOSE AND DISTINGUISHING CHARACTERISTICS\nTo assist in developing department policies, assist in long-range planning for the department, recommend priorities for department resource allocation, help develop the department's annual appropriations request for submission to the Board of Supervisors, help promote cost-effective management practices in the department, and in general, assist the Sheriff in achieving his overall objectives of efficiency, economy and effectiveness in public safety services for the citizens of San Diego County.\nAssistant Sheriffs are unclassified management positions serving at the pleasure of the Sheriff without civil service tenure. They are part of the Sheriff's top management staff and they assist the Sheriff and Undersheriff in the overall administration of the Department by managing the Sheriff's three major budget programs. These programs are Law Enforcement Services, Detention Facility Services and Administration Services. The Undersheriff directly supervises Assistant Sheriffs, and they in turn supervise sworn and civilian managers of major bureaus and divisions.\nCounty Charter Section 908.2(c) authorizes these positions.\nEXAMPLES OF DUTIES\nEssential Functions:\nAs the Program Manager of a major functional responsibility of the Sheriff, an Assistant Sheriff operates within policy established by the Sheriff, and under general supervision of the Undersheriff, to maximize the assigned personnel, equipment, supplies and budget appropriations to accomplish the programs objectives and outputs. Typical tasks of an Assistant Sheriff include:\nPlans, organizes, staffs, and coordinates bureau and division activities within assigned programs.\nConducts assessment, program needs, analyzes data and develops operational plans.\nDevelops, plans, organizes, and conducts training sessions to build management and supervisory team effort.\nResearches practices, case laws, and statutory laws within assigned program.\nRepresents the Sheriff's Department with other County departments or criminal justice agencies.\nEngages in community and public relations programs, appears as a public speaker, and participates in professional associations affecting assigned programs.\nProvides responsive, high quality service to County employees, representatives of outside agencies and members of the public.\nMore specific management responsibilities for each program are as follows:\nAssistant Sheriff – Law Enforcement Services:\nUnder policy direction of the Sheriff and general supervision of the Undersheriff, the Assistant Sheriff for the Law Enforcement Services is responsible for managing the Sheriff's Law Enforcement Services Program on a Countywide basis. This program provides the direct law enforcement services to residents of the unincorporated areas, and contract cities. In addition, provides regional law enforcement support services to municipal police departments in the County. The Assistant Sheriff maintains liaison with City managers and councils of the contract cities and with the police chiefs of municipalities.\nThe Assistant Sheriff for Law Enforcement Services directly supervises Sheriff's Commanders who head the Law Enforcement Operations Bureau and the Law Enforcement Support Bureau and oversee the management responsibility of managers who head decentralized stations and divisions.\nAs manager of the Sheriff's Law Enforcement Services Budget Program, this Assistant Sheriff is responsible for employees consisting of sworn officers and civilian personnel. Employees within this program are deployed throughout the County at separate locations, including the Sheriff's main office, stations, substations, and residents' offices.\nAssistant Sheriff – Detention Facility Services:\nUnder policy direction of the Sheriff and general supervision of the Undersheriff, the Assistant Sheriff for Detention Facility Services is responsible for managing the Sheriff's Detention Facility Services Program on a Countywide basis. This program provides a regional service to the entire County, including all law enforcement agencies and all of the courts, by receiving, booking, detaining, and releasing those who are charged with or convicted of criminal offenses. In addition, the program provides a range of food, medical, psychiatric, dental, clothing, counseling and religious services to inmate population consisting of men and women in separate detention facilities.\nThe Assistant Sheriff for the Detention Facility Services directly supervises Sheriff's Commanders who head the Detention Facility Operations Bureau and the Detention Facility Support Bureau and oversee the management responsibilities of managers, both sworn and civilian, who head the Detention Facilities and major support divisions.\nAs manager of the Sheriff's Detention Facility Services Budget Program, this Assistant Sheriff is responsible for employees, consisting of sworn officers and civilian personnel. Employees within this program are deployed at locations throughout the County, including the Sheriff's main office and detention facilities.\nAssistant Sheriff – Administrative Services:\nUnder policy direction of the Sheriff and general supervision of the Undersheriff, the Assistant Sheriff for the Administrative Services is responsible for managing the Sheriff's Administrative Services Program. This program provides internal administrative and staff support to the entire department employees. The program also provides regular liaison with other County service departments, and provides some specialized services directly to the public and other criminal justice agencies. The functions of the Administrative Services Program include Personnel Administration, Recruitment, Affirmative Action, Background Investigation, Training (Recruit, In-Service, Weapons) Career Planning, Internal Affairs Division, Crime Prevention, Juvenile Diversion, International Liaison, Industrial Relations, Public Information, Payroll Administration, Budget and Planning, Fiscal Control, Property Management, Records Division, and License Division. These functions are provided for a complex, widely decentralized, 24 hour-a-day, public safety service organizations. This program also services police departments, prosecutors and the courts with some of its regional functions such as Records, Training, etc.\nThe Assistant Sheriff for Administrative Services directly supervises a Sheriff's Commander who heads the Special Services Bureau and civilian director who heads the Office of Staff Services. The Assistant Sheriff also oversees the management responsibilities of division managers, both sworn and civilian and acts as the Sheriff's personnel liaison to the Board Officers, the Chief Administrative Officer's budget staff, the Auditor/Controller's staff, and the Department of Human Resources.\nAs manager of the Sheriff's Administrative Services Program, this Assistant Sheriff is responsible for employees assigned to the program including sworn officers and civilian personnel. Employees within this program are deployed at separate locations in the County, including the Sheriff's main office, training facilities, stations and substations.\nKNOWLEDGE, SKILLS AND ABILITIES\nKnowledge of:\nLocal law enforcement agencies in San Diego County\nLocal, State, and Federal laws\nLaw enforcement rules and regulations\nCommunity-based policing\nFamiliarization between law enforcement and community residents\nDepartment policies, procedures, and San Diego County Administrative Code\nHuman resources management and leadership principles\nBudget analysis and effective utilization of fiscal resources\nPrinciples of management and organizational analysis\nCounty customer service objectives and strategies\nCurrent technology and trends in the profession\nTelephone, office and online etiquette\nGeneral Management System (GMS) in principle and in practice\nSkills and Abilities to:\nPlan, organize and direct the activities of a large law enforcement agency\nPrepare budget requests and monitor revenues and expenditures\nEstablish internal administrative policy, controls, and guidelines related to the Sheriff's Department\nEnsure that departmental activities conform to Federal, State, and local laws and regulations\nIdentify and resolve departmental operational problems\nAnalyze, interpret, and apply pertinent provisions of governmental policies, mandates, legislation, and contracts\nOrganize and define organizational staff and service options\nApply collaborative problem solving\nPrepare executive-level correspondence, reports, budget and contract documents\nMake oral presentations for public officials, executive management, the media, and the general public\nEstablish and maintain effective working relationships with those contacted in the course of work\nSupervise, train, counsel, and review the work of subordinates\nMaintain effective audio-visual discrimination and perception needed for making observations, communicating with others and reading and writing\nMaintain mental capacity, which allows the capability of making sound decisions and demonstrating intellectual capacities\nCORE VALUES\nIntegrity, Stewardship and Commitment\nLEADERSHIP COMPETENCIES\nInitiative\nProblem Solving\nResults Oriented\nInterpersonal Relationships\nOrganizational Acumen\nDevelopment of Others\n.\nEDUCATION AND/OR EXPERIENCE\nA bachelor's degree from an accredited U.S. college or university, or a certified foreign studies equivalency, AND, five (5) years of related management level experience OR\nAn associate's degree from an accredited U.S. college or university, or a certified foreign studies equivalency, AND, seven (7) years of related management level experience OR\nNine (9) years of related management level experience.\nNOTE:\nPositions in this classification are Peace Officers as defined in Section 830 of the California Penal Code, and must meet employment guidelines and standards established by the Commission for Peace Officer Standards and Training (POST), the provisions of Sections 1029 and 1031 of the California Government Code, and STC Selection and Training Standards as contained in Title 15, Section 100-358, California Code of Regulations. Applicants must be 21 years of age by the time of appointment. A Valid Peace Officer Standards Training (POST) certificate and ability to carry a firearm are required and must be maintained throughout your employment as an Assistant Sheriff with the San Diego Sheriff's Department.\n.\nREQUIRED LICENSES, CERTIFICATIONS OR REGISTRATIONS\nRequired licenses, certifications and registrations must be maintained throughout employment in this class.\nPositions may involve necessary and timely transportation for field travel, requiring the ability to arrange transportation to different worksites, meetings, or field work.\nCertification/Registration\nAppointees enter the County Retirement System as a Safety Member and are not covered under Social Security.\nPositions in this classification are Peace Officers as defined in Section 830 of the California Penal Code, and must meet employment guidelines and standards established by the Commission for Peace Officer Standards and Training (POST), the provisions of Sections 1029 and 1031 of the California Government Code, and STC Selection and Training Standards as contained in Title 15, Section 100-358, California Code of Regulations. Applicants must be 21 years of age by the time of appointment. A valid Police Officer Standard Training (POST) certificate and ability to carry a firearm are required and must be maintained throughout your employment as a Assistant Sheriff with the San Diego Sheriff's Department.\nWorking Conditions\nOffice environment; exposure to computer screens.\nEssential Physical Characteristics\nThe physical characteristics described here are representative of those that must be met by an employee to successfully perform the essential functions of this classification. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions of a job, on a case-by-case basis.\nFrequent: sitting and repetitive use of hands, including simple grasping and fine manipulation. Occasional: walking, standing, bending and twisting of neck, bending and twisting of waist, squatting, kneeling, power grasping, pushing and pulling, reaching above and below shoulder level, and lifting and carrying of files weighing up to 10 pounds.\nBackground Investigation\nMust have a reputation for honesty and trustworthiness. Felony convictions will be disqualifying. Misdemeanor convictions may be disqualifying depending on type, number, severity, and recency. Prior to appointment, candidates will be subject to a thorough background investigation which may include a psychological, truth verification or other examination or test.\nPROBATIONARY PERIOD\nPersons serving in positions in the Unclassified Service do not accrue tenure and serve at the pleasure of the appointing authority.\nThe County of San Diego and its employees embrace the Live Well San Diego initiative to improve the health and wellness of all County residents. For more information visit\nwww.livewellsd.org.\nAssistant Sheriff (Class No. 000265)          Union Code: NE"
  }
]
